POS_TRANSLATION = {
    "NOUN": "Существительное",
    "VERB": "Глагол",
    "ADJ": "Прилагательное",
    "ADV": "Наречие",
    "PRON": "Местоимение",
    "DET": "Определитель",
    "ADP": "Предлог",
    "CCONJ": "Союз",
    "SCONJ": "Подчинительный союз",
    "INTJ": "Междометие",
    "PART": "Частица",
    "AUX": "Вспомогательный глагол",
    "NUM": "Числительное",
    "PROPN": "Имя собственное",
    "PUNCT": "Знак препинания",
    "SYM": "Символ",
    "X": "Неизвестное слово"
}

NUMBER_TRANSLATION = {
    "Sing": "Единственное число",
    "Plur": "Множественное число"
}

TENSE_TRANSLATION = {
    "Past": "Прошедшее время",
    "Pres": "Настоящее время",
    "Fut": "Будущее время"
}

CASE_TRANSLATION = {
    "Nom": "Именительный падеж",
    "Gen": "Родительный падеж",
    "Dat": "Дательный падеж",
    "Acc": "Винительный падеж",
    "Abl": "Творительный падеж",
    "Loc": "Предложный падеж",
    "Voc": "Звательный падеж"
}

DEGREE_TRANSLATION = {
    "Pos": "Положительная степень",
    "Cmp": "Сравнительная степень",
    "Sup": "Превосходная степень"
}

DEP_TRANSLATION = {
    "nsubj": "Подлежащее",
    "nsubjpass": "Подлежащее (пассивный залог)",
    "dobj": "Прямое дополнение",
    "pobj": "Предложное дополнение",
    "iobj": "Косвенное дополнение",
    "root": "Сказуемое",
    "amod": "Определение",
    "advmod": "Обстоятельство",
    "advcl": "Придаточное обстоятельственное",
    "prep": "Предлог",
    "cc": "Союз",
    "mark": "Подчинительный союз",
    "appos": "Приложение",
    "conj": "Часть сочиненного выражения",
    "ccomp": "Дополнительное придаточное предложение",
    "xcomp": "Объектное придаточное предложение",
    "aux": "Вспомогательный глагол",
    "cop": "Глагол-связка",
    "det": "Определитель",
    "poss": "Притяжательный элемент",
    "compound": "Составное слово",
    "case": "Падежная связь",
    "acl": "Относительное придаточное предложение",
    "relcl": "Относительное придаточное",
    "parataxis": "Паратаксис (синтаксическая независимость)",
    "punct": "Знак препинания"
}

PERSON_TRANSLATION = {
    "1": "1-е",
    "2": "2-е",
    "3": "3-е"
}

ASPECT_TRANSLATION = {
    "Perf": "Совершенный",
    "Imp": "Несовершенный"
}

VOICE_TRANSLATION = {
    "Act": "Действительный",
    "Pass": "Страдательный"
}

MOOD_TRANSLATION = {
    "Ind": "Изъявительное",
    "Imp": "Повелительное",
    "Sub": "Сослагательное"
}

GENDER_TRANSLATION = {
    "Masc": "Мужской",
    "Fem": "Женский",
    "Neut": "Средний"
}

DEFINITE_TRANSLATION = {
    "Def": "Определённое (the)",
    "Ind": "Неопределённое (a/an)"
}
